Revit 2026 API
MassSurfaceData.PercentageSkylights Property
 The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double PercentageSkylights { get; set; }
Public Property PercentageSkylights As Double
	Get
	Set
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
member PercentageSkylights : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The percentage skylights value is between 0.00 and 0.95.
Remarks
 The resulting coverage of the roof with skylights is not guaranteed to match this value. It is a target.
See Also
Reference
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace